import {Space, Table, Tag} from 'antd';
import {TableDay} from "./TableDay";
import {useEffect} from "react";

const data = [
  {
    date: 'Понедельник',
    data: [
      {
        time: '8:30-9:10',
        c10g: <>Английский язык<br/>Иванова В.В. 404/ <br/> Кайдаш М.А. 402</>,
        c10se: <>Индивидуальный проект<br/>Володин Р.С. 312</>,
        c10t: <>Литература<br/>Меркулова К.И.</>,
        c11g: <>Испанский язык<br/>Колбасова А.О. 307/ <br/> Дегтярь Д.М. 310</>,
        c11se: <>Обществознание<br/>Казанцев О.А.</>,
        c11t: <>История<br/>Димидов Л.Г.</>,
      },
      {
        time: '9:20-10:00',
        c10g: <>Испанский язык<br/>Колбасова А.О. 307/ <br/> Дегтярь Д.М. 310</>,
        c10se: <>Английский язык<br/>Антонова Н.И. 402/ <br/> Кайдаш М.А. 404</>,
        c10t: <>История<br/>Димидов Л.Г.</>,
        c11g: <>Индивидуальный проект<br/>Володин Р.С. 312</>,
        c11se: <>Математика<br/>Шкурай И.А.</>,
        c11t: <>Физика<br/>Коваль В.В.</>,
      },
      {
        time: '10:10-10:50',
        c10g: 'Английский язык\nИванова В.В. 404/\n Кайдаш М.А. 402',
        c10se: 'Обществознание\nКазанцев О.А.',
        c10t: '<>Физика\nКоваль В.В.',
        c11g: '<>Испанский язык\nКолбасова А.О. 307/\nДегтярь Д.М. 310',
        c11se: 'История\nДимидов Л.Г.',
        c11t: 'Индивидуальный проект\nВолодин Р.С. 312',
      },
      {
        time: '11:00-11:40',
        c10g: 'Столовая, пауза',
        c10se: 'Пауза, столовая',
        c10t: <>Физика<br/>Коваль В.В.</>,
        c11g: <>Математика<br/>Шкурай И.А.</>,
        c11se: <>Индивидуальный проект<br/>Володин Р.С. 312</>,
        c11t: <>Английский язык<br/>Иванова В.В. 404/ <br/> Антонова Н.И. 402</>,
      },
      {
        time: '11:50-12:30',
        c10g: <>Английский язык<br/>Иванова В.В. 404/ <br/> Кайдаш М.А. 402</>,
        c10se: <>Обществознание<br/>Казанцев О.А.</>,
        c10t: 'Столовая, пауза',
        c11g: 'Пауза, столовая',
        c11se: <>История<br/>Димидов Л.Г.</>,
        c11t: <>Физика<br/>Коваль В.В.</>,
      },
      {
        time: '12:40-13:20',
        c10g: <>Английский язык<br/>Иванова В.В. 404/ <br/> Кайдаш М.А. 402</>,
        c10se: <>История<br/>Димидов Л.Г.</>,
        c10t: <>Физика<br/>Коваль В.В.</>,
        c11g: <>Математика<br/>Шкурай И.А.</>,
        c11se: 'Столовая, пауза',
        c11t: 'Пауза, столовая',
      },
      {
        time: '13:30-14:10',
        c10g: <>Разговоры о важном<br/>Иванова В.В.</>,
        c10se: <>История<br/>Димидов Л.Г.</>,
        c10t: <>Индивидуальный проект<br/>Володин Р.С. 312</>,
        c11g: <>Разговоры о важном<br/>Меркулова К.И.</>,
        c11se: <>Математика<br/>Шкурай И.А.</>,
        c11t: <>Физика<br/>Коваль В.В.</>,
      },
      {
        time: '14:20-15:00',
        c10g: <>Индивидуальный проект<br/>Володин Р.С. 312</>,
        c10se: <>Разговоры о важном<br/>Димидов Л.Г.</>,
        c10t: <>Разговоры о важном<br/>Мирошник М.И.</>,
        c11g: <>Английский язык<br/>Иванова В.В. 404/ <br/> Жольнай Н.П. 402</>,
        c11se: <>Разговоры о важном<br/>Казанцев О.А.</>,
        c11t: <>Разговоры о важном<br/>Артемчук В.Д.</>,
      },
    ],
  }
];

export function TableComponent() {
  useEffect(()=>{
    // Request to server url when it's ready to send data;
  }, []);
  return (
    <div className="App">
      <h1>Расписание</h1>
      <Space size="large" style={{alignItems: 'flex-start'}}>
        {data.map(({date, data}) => <TableDay data={data} date={date}/>)}
      </Space>
    </div>
  );
}
