import {TableDayProps} from "./TableDay";
import dayjs, {Dayjs} from "dayjs";
import {WeekDayE} from "../types";
import {WeekDateDayResponse} from "../../externals/admin/adminRepositories";

const DEFAULT_START_WEEK_DATE_STRING = '2023-02-27';
const DEFAULT_START_WEEK_DATE = dayjs(DEFAULT_START_WEEK_DATE_STRING);
const dateToDateString = (date: Dayjs): string => date.format('YYYY-MM-DD');
const addDayToStr = (value: number) => dateToDateString(DEFAULT_START_WEEK_DATE.add(1, 'day'));
export const createEditData = () => ({
  data: createWeekDay(),

});

export const createWeekDay = (weekDayData?: Partial<TableDayProps>): WeekDateDayResponse => ({
  weekDay: WeekDayE.Monday,
  date: DEFAULT_START_WEEK_DATE_STRING,
  data: mockDay.data,
  ...weekDayData
});

const mockDay = {
  weekDay: 'Понедельник',
  date: '2023-02-27',
  data: [
    {
      time: ['08:30', '09:10'],
      c10g: {
        subjectId: 0, teachers: [{
          teacher: id,
          room: string
        }]
      }, 'Английский язык\nИванова В.В. 404/\nКайдаш М.А. 402',
      c10se: `Индивидуальный проект\nВолодин Р.С. 312`,
      c10t: `Литература\nМеркулова К.И.`,
      c11g: `Испанский язык\nКолбасова А.О. 307/ \n Дегтярь Д.М. 310`,
      c11se: `Обществознание\nКазанцев О.А.`,
      c11t: `История\nДимидов Л.Г.`,
    },
    {
      time: ['09:20', '10:00'],
      c10g: `Испанский язык\nКолбасова А.О. 307/ \n Дегтярь Д.М. 310`,
      c10se: `Английский язык\nАнтонова Н.И. 402/ \n Кайдаш М.А. 404`,
      c10t: `История\nДимидов Л.Г.`,
      c11g: `Индивидуальный проект\nВолодин Р.С. 312`,
      c11se: `Математика\nШкурай И.А.`,
      c11t: `Физика\nКоваль В.В.`,
    },
    {
      time: ['10:10', '10:50'],
      c10g: 'Английский язык\nИванова В.В. 404/\n Кайдаш М.А. 402',
      c10se: 'Обществознание\nКазанцев О.А.',
      c10t: 'Физика\nКоваль В.В.',
      c11g: 'Испанский язык\nКолбасова А.О. 307/\nДегтярь Д.М. 310',
      c11se: 'История\nДимидов Л.Г.',
      c11t: 'Индивидуальный проект\nВолодин Р.С. 312',
    },
    {
      time: ['11:00', '11:40'],
      c10g: 'Столовая, пауза',
      c10se: 'Пауза, столовая',
      c10t: `Физика\nКоваль В.В.`,
      c11g: `Математика\nШкурай И.А.`,
      c11se: `Индивидуальный проект\nВолодин Р.С. 312`,
      c11t: `Английский язык\nИванова В.В. 404/ \n Антонова Н.И. 402`,
    },
    {
      time: ['11:50', '12:30'],
      c10g: `Английский язык\nИванова В.В. 404/ \n Кайдаш М.А. 402`,
      c10se: `Обществознание\nКазанцев О.А.`,
      c10t: 'Столовая, пауза',
      c11g: 'Пауза, столовая',
      c11se: `История\nДимидов Л.Г.`,
      c11t: `Физика\nКоваль В.В.`,
    },
    {
      time: ['12:40', '13:20'],
      c10g: `Английский язык\nИванова В.В. 404/ \n Кайдаш М.А. 402`,
      c10se: `История\nДимидов Л.Г.`,
      c10t: `Физика\nКоваль В.В.</`,
      c11g: `Математика\nШкурай И.А.`,
      c11se: 'Столовая, пауза',
      c11t: 'Пауза, столовая',
    },
    {
      time: ['13:30', '14:10'],
      c10g: `Разговоры о важном\nИванова В.В.`,
      c10se: `История\nДимидов Л.Г.`,
      c10t: `Индивидуальный проект\nВолодин Р.С. 312`,
      c11g: `Разговоры о важном\nМеркулова К.И.`,
      c11se: `Математика\nШкурай И.А.`,
      c11t: `Физика\nКоваль В.В.`,
    },
    {
      time: ['14:20', '15:00'],
      c10g: `Индивидуальный проект\nВолодин Р.С. 312`,
      c10se: `Разговоры о важном\nДимидов Л.Г.`,
      c10t: `Разговоры о важном\nМирошник М.И.`,
      c11g: `Английский язык\nИванова В.В. 404/ \n Жольнай Н.П. 402`,
      c11se: `Разговоры о важном\nКазанцев О.А.`,
      c11t: `Разговоры о важном\nАртемчук В.Д.`,
    },
  ],
};
